//This is a generic page to view. Source: https://uk.wikipedia.org/wiki/Google
import React, {useState, useEffect} from "react"
import Base from "./Base"

export default function Google(props) {
    const url = "http://localhost:5000/google"
    const [counter, setCounter] = useState(1)
    //Increment user counter when the page is loaded:
    useEffect(() => {
        console.log("It's the use effect!")
        fetch(url, {method: "GET"})
            .then(response => {return response.text()})
            .then(response => setCounter(response))
            .catch(error => console.log(error))
         //Decrement user counter when the user leaves the page:
         window.addEventListener("unload", () => {
            navigator.sendBeacon(url, {method: "POST"})
                .then(response => {return response.text()})
                .then(response => console.log(response))
                .catch(error => console.log(error))
            window.removeEventListener("unload", () => {})
         }
        )
    }, [])

    if (!props.user) return (<div><Base/></div>)
    return (<div>
        <h1>Google</h1>
        <h2>Currently active users: {counter}</h2>
        <p>Google, українською мовою ґуґл, англ. Google LLC (вимовляється [ˈɡuːɡəl]) —
            американська публічна транснаціональна корпорація, яку заснували 1998 року
            аспіранти Стенфордського університету Ларрі Пейдж і Сергій Брін.</p>
        <p>Найпопулярніший пошуковий сервіс станом на 2021 рік, має у власності,
            зокрема, YouTube і Blogger. Штаб-квартира корпорації розташована в 
            Кремнієвій долині, представництва компанії також є в Північній Америці,
            Австралії, Європі й Азії.</p>
        <p>Google.com — найвідвідуваніший сайт у світі (поряд із facebook.com).
            Водночас компанію звинувачують у порушенні права на приватність,
            авторського права та цензури.</p>
        <p>Google заснована 4 вересня 1998 року як приватна компанія, що займається
            розробкою, розвитком і дизайном найпопулярнішого в інтернеті пошукового
            сервісу. Google підтримує та розробляє низку інтернет-сервісів і продукції,
            отримуючи дохід передусім від реклами, завдяки своїй програмі Ads.
            Компанію заснували Ларрі Пейдж і Сергій Брін. 19 серпня 2004 року Google
            розпочала продаж своїх акцій на фондовому ринку. Тоді Ларрі Пейдж, Сергій
            Брін та Ерік Шмідт домовилися про спільну співпрацю протягом 20 років, до
            2024 року. Проголошеною місією компанії від самого початку була «організація
            світової інформації, забезпечення її доступності та користі для всіх», а
            неофіційне гасло компанії, придумане інженером Google Полом Бакгейтом —
            «Не будь злим» (англ. Don't be evil). 2003 року компанія переїхала до своєї
            нинішньої штаб-квартири в Маунтін-В'ю (штат Каліфорнія), де працюють близько
            28 тис. робітників.</p>
        <p>Google керує понад мільйоном серверів у центрах опрацювання даних (ЦОД) у
            всьому світі, опрацьовуючи більше мільярда пошукових запитів і 24 петабайт
            користувацьких даних щодня. Швидкий ріст Google з моменту його заснування
            призвів до виникнення великої кількості продукції, не пов'язаної
            безпосередньо з головним продуктом компанії — пошуковою системою. Google
            має онлайн-продукти на кшталт поштового сервісу Gmail. У компанії є також
            і десктопні продукти, такі як браузер Google Chrome і програма обміну
            миттєвими повідомленнями Google Hangouts. Крім того, Google веде розробку
            мобільної операційної системи Android, яка використовується великою
            кількістю смартфонів, а також операційної системи Google Chrome OS.</p>
        <p>За версією BrandZ, Google — найсильніший[23] бренд у світі, а за версією
            компанії Brand-Finance — найдорожчий (44,3 млрд дол.) бренд світу у 2011
            році.[24][25] Проте в 2015 і в 2016 році вартість бренду була другою після
            бренду Apple.[26] 2011 року Google було визнано компанією з найкращою
            репутацією в США.</p>
        <p>Назва «Google», за найпоширенішою версією, — спотворене написання слова
            «ґуґол» (англ. googol), яке придумав Мілтон Сіротта, племінник
            американського математика Едварда Кайзера.</p>
    </div>)
}
